Repository: kuleszdl/SIFEI
Catalog: SIF.Visualization.Excel/PolicyConfigurationDialog.*.resx
Languages: de

# Button_Cancel.Text
source: Cancel
de: Abbrechen

# FormulaComplexity.Text
source: FormulaComplexity
de: Formelkomplexität überprüfen

# ReadingDirection.Text
source: ReadingDirection
de: Leserichtung überprüfen

# NoConstantsInFormulas.Text
source: NoConstantsInFormulas
de: Formeln auf Konstanten überprüfen

# MultipleSameRef.Text
source: MultipleSameRef
de: Formeln auf gleiche Verweise überprüfen

# NonConsideredConstants.Text
source: NonConsideredConstants
de: Konstanten ohne Bezug suchen

# RefToNull.Text
source: RefToNull
de: Verweise auf leere Zellen suchen

# OneAmongOthers.Text
source: OneAmongOthers
de: Typüberprüfung ben. Zellen überprüfen

# StringDistance.Text
source: StringDistnace
de: Levensthein Distanz berechnen (Tippfehler)

# StringDistanceMinDistanceLabel.Text
source: minimal allowed Distance
de: Minimal erlaubte Distanz

# ErrorInCells.Text
source: ErrorInCells
de: Ungültigkeit in Zellen überprüfen

# FormulaComplexityMaxNestingLabel.Text
source: Max Nesting
de: Erlaubte Verschachteltungstiefe

# FormulaComplexityMaxOperationsLabel.Text
source: Max Operations
de: Erlaubte Anzahl an Operationen

# OneAmongOthersLengthLabel.Text
source: Lenght
de: Suchweite

# ReadingDirectionLeftRight.Text
source: left to right
de: Links-Rechts Regel

# ReadingDirectionTopBottom.Text
source: top to bottom
de: Oben-Unten Regel

# OneAmongOthersStyleHorizontal.Text
source: horizontal
de: horizontale Suchrichtung

# OneAmongOthersStyleVertical.Text
source: vertical
de: vertikale Suchrichtung

# OneAmongOthersStyleBoth.Text
source: both
de: beide Richtungen
