Repository: kuleszdl/SIFEI
Catalog: SIF.Visualization.Excel/Properties/Resources.*.resx
Languages: de

# tl_Ribbon_AreaScan_AutomaticScansCheckbox
source: Automatic scans
de: Automatisch prüfen

# tl_Ribbon_AreaScan_PolicyConfigurationButton
source: Policy configuration
de: Regeln konfigurieren

# tl_Ribbon_AreaScan_ScanButton
source: Scan
de: Prüfen

# tl_Ribbon_AreaScan_ScanButtonTooltip
source: Scans the current workbook with all scenarios.
de: Prüft die aktuelle Arbeitsmappe bezüglich der Einhaltung aller aktivierten Regeln

# tl_Ribbon_AreaScan_Title
source: Test
de: Aktionen

# tl_Ribbon_Title
source: INSPECTION
de: INSPEKTION

# tl_Ribbon_AreaScenario_CancelButton
source: Cancel
de: Verwerfen

# tl_Ribbon_AreaScenario_CancelButtonTolltip
source: Discard this scenario
de: Verwirft alle Änderungen am aktuellen Testszenario

# tl_Ribbon_AreaScenario_NewButton
source: New
de: Neu

# tl_Ribbon_AreaScenario_NewButtonTooltip
source: Creates a new scenario
de: Erstellt ein neues Testszenario

# tl_Ribbon_AreaScenario_SaveButton
source: Save
de: Speichern

# tl_Ribbon_AreaScenario_SaveButtonTooltip
source: Save this scenario
de: Speichert das aktuelle Testszenario

# tl_Ribbon_AreaScenario_Title
source: Scenario
de: Testszenario

# tl_Ribbon_AreaView_PaneButton
source: Inspection Pane
de: Seitenleiste

# tl_Ribbon_AreaView_PaneButtonTooltip
source: Opens a pane with the cell definitions, scenario overview and findings.
de: Öffnet bzw. schließt eine Seitenleiste, die Befunde, festgelegte Zellen und mehr anzeigt.

# tl_Ribbon_AreaView_ResetButton
source: Reset document
de: Befundmarker entfernen

# tl_Ribbon_AreaView_ResetButtonTooltip
source: Resets the document to the state before the test execution.
de: Entfernt alle Befundmarkierungen in der Hauptansicht

# tl_Ribbon_AreaDefine_Inputcell
source: Input Cell
de: Eingabezelle

# tl_Ribbon_AreaDefine_InputcellTooltip
source: Defines a Input Cell.
de: Klicken um die aktuelle Zelle als Eingabezelle festzulegen. Diese Schaltfläche leuchtet auch auf, wenn sie eine bereits festgelegte Zelle anwählen.

# tl_Ribbon_AreaDefine_Intermediatecell
source: Intermediate Cell
de: Zwischenergebniszelle

# tl_Ribbon_AreaDefine_IntermediatecellTooltip
source: Defines a Intermediate Cell.
de: Klicken um die aktuelle Zelle als Zwischenergebniszelle festzulegen. Diese Schaltfläche leuchtet auch auf, wenn sie eine bereits festgelegte Zelle anwählen.

# tl_Ribbon_AreaDefine_Resultcell
source: Result Cell
de: Ergebniszelle

# tl_Ribbon_AreaDefine_ResultcellTooltip
source: Defines a Result Cell.
de: Klicken um die aktuelle Zelle als Ergebniszelle festzulegen. Diese Schaltfläche leuchtet auch auf, wenn sie eine bereits festgelegte Zelle anwählen.

# tl_Ribbon_AreaDefine_Title
source: Define Scenario Cells
de: Zellen festlegen

# tl_Ribbon_AreaMiscellaneous_GlobalSettingsButton
source: Global Settings
de: Server Einstellungen

# tl_Ribbon_AreaMiscellaneous_Title
source: Miscellaneous
de: Sonstiges

# tl_CellErrorInfo_PossibleSolution
source: Possible Solution
de: Mögliche Behebung

# tl_CellErrorInfo_Background
source: Background
de: Hintergrund

# tl_ViolationTemplate_Background
source: Background:
de: Hintergrund:

# tl_ViolationTemplate_Description
source: Description:
de: Beschreibung:

# tl_ViolationTemplate_FirstOccurence
source: First occurence:
de: Erster Fund:

# tl_ViolationView_Ignore
source: ignore
de: ignorieren

# tl_ViolationView_Later
source: later
de: später

# tl_ViolationTemplate_LessDetails
source: Less details
de: Weniger Details

# tl_ViolationTemplate_MoreDetails
source: More details
de: Mehr Details

# tl_ViolationTemplate_PossibleSolution
source: Possible solution:
de: Mögliche Lösung

# tl_ViolationTemplate_Type
source: Type:
de: Typ:

# tl_ViolationView_Footer
source: violation(s) in list
de: Befund(e) in dieser Liste

# tl_Ribbon_AreaMiscellaneous_ShowSanity
source: Show sanity controls
de: Plausi-Steuerung anzeigen

# tl_NewScenarioDialog_DefaultAnswer
source: Untitled new scenario
de: Unbenanntes neues Testszenario

# tl_NewScenarioDialog_Question
source: Please give your scenario a name:
de: Bitte geben Sie dem neuen Szenario einen Namen

# tl_NewScenarioDialog_Title
source: New Scenario...
de: Neues Testszenario...

# tl_Ribbon_MessageNoPolicies
source: No policies, scenarios or custom rules are enabled for manual scans. Please enable a policy or create a scenario or custom rule and try again.
de: Es sind keine Regeln für die Prüfung aktiviert und keine Testszenarien oder eigene Regeln vorhanden. Aktivieren Sie bitte mindestens eine Regel oder erstellen Sie ein Szenario und versuchen Sie es erneut.

# tl_Ribbon_MessageNoPolicies_Title
source: Error
de: Prüfung nicht möglich.

# tl_OpenView_Empty
source: No open findings
de: Keine offenen Befunde

# tl_Sidebar_Archived
source: Archived findings
de: Archiviert

# tl_Sidebar_Cells
source: Marked cells
de: Markierte Zellen

# tl_Sidebar_Ignored
source: Ignored findings
de: Ignoriert

# tl_Sidebar_Later
source: Findings for later
de: Später

# tl_Sidebar_Open
source: Open findings
de: Offen

# tl_Sidebar_Scenarios
source: Scenarios
de: Testszenarien

# tl_SolvedView_Empty
source: No solved findings
de: Keine gelösten Befunde archiviert

# tl_ScenarioPane_DeleteConfirmQuestion
source: Are you sure you want to delete the scenario named
de: Sind Sie sicher, dass Sie folgendes Szenario löschen möchten

# tl_ScenarioPane_DeleteConfirmQuestionTitle
source: Delete scenario
de: Testszenario löschen

# tl_ScenarioPane_DeleteScenario
source: Delete scenario
de: Szenario löschen

# tl_ScenarioPane_DeleteScenarioTooltip
source: Deletes the selected scenario
de: Löscht dieses Testszenario

# tl_Ribbon_MessageNoScansInScnearioMode
source: You cannot run a scan while editing a scenario. Save or discard the scenario and try again.
de: Sie können keine Prüfung starten, während Sie ein Testszenario bearbeiten. Speichern oder verwerfen Sie das Szenario und versuchen Sie es erneut.

# tl_Ribbon_MessageNoScansInScnearioModeTitle
source: Scanning not possible now
de: Prüfung derzeit nicht möglich

# tl_ScenarioPane_NoScenarios
source: No scenarios created. Please create a new scenario from the Ribbon menu.
de: Keine Testszenarien Bitte markieren Sie Zellen und erstellen Sie ein neues Szenario, um es hier zu sehen.

# tl_ProcessingScan
source: Processing scan
de: Prüfung wird durchgeführt

# tl_Scan_successful
source: Scan successful
de: Erfolgreiche Prüfung durchgeführt

# tl_Scan_unsuccessful
source: Scan unsuccessful
de: Prüfung konnte nicht erfolgreich beendet werden

# tl_NoScanPossible
source: Scaning not avaliable right now
de: Keine Prüfung möglich

# tl_ScenarioPane_EditScenarioTooltip
source: Opens a new window to edit the scenario
de: Öffnet ein neues Fenster um das Testszenario zu bearbeiten

# tl_ScenarioDetailView_DeleteData
source: Delete cell
de: Zelle löschen

# tl_ScenarioDetailView_SaveData
source: Save
de: Speichern

# tl_ScenarioDetailView_DeleteDataTooltip
source: Delete selected cell
de: Ausgewählte Zelle löschen

# tl_ScenarioDetailView_DiscardData
source: Discard
de: Verwerfen

# tl_ScenarioDetailView_DiscardDataTooltip
source: Discards the changes on the selected scenario
de: Verwirft die vorgenommen Änderungen im Testszenario

# tl_ScenarioDetailView_SaveDataTooltip
source: Save changes in the open scenario
de: Speichert die Änderungen im geöffnete Testszenario

# tl_ScenarioDetailView_DiscardDataMessageBox
source: Are you sure you want to discard the changes?
de: Sind sie sicher, dass sie Ihre Änderungen verwerfen wollen?

# tl_ScenarioDetailView_DiscardDataMessageBoxTitle
source: Discard changes
de: Änderungen verwerfen

# tl_Load_Failed
source: The following parts were unable to load:
de: Die Folgenden Teile konnten nicht geladen werden:

# tl_Load_Failed_Title
source: Loading from workbook failed
de: Laden aus dem Workbook nicht geklappt

# tl_MessageBox_Error
source: Error
de: Fehler

# tl_No_Java_Enviroment
source: No java runtime was found! Please ensure a Java runtime environment >= 1.7 is installed and accessible through the PATH variable. The Scan button will be without function.
de: Java Runtime wurde nicht gefunden! Bitte stellen sie sicher, dass die Java Runtime in der Version 1.7 oder höher installiert ist und in der PATH Variable gesetzt wurde

# tl_Number_Format
source: Number format
de: Nummernformat

# tl_Path_install
source: Please install the Spreadsheet Inspection Framework and restart Excel.
de: Bitte installieren sie das Spreadsheet Inspection Framework und starten sie Excel neu.

# tl_Path_missing
source: The Spreadsheet Inspection Framework was not found at this location:
de: Das Spreadsheet Inspection Framework wurde im folgenden Ordner nicht gefunden:

# tl_Scan_failed
source: The test of the current document failed!
de: Der Test der aktuellen Datei ist fehlgeschlagen

# tl_Scan_needingsavetitle
source: Scan aborted
de: Prüfung abgebrochen

# tl_Scan_needssave
source: The file needs to be saved before a scan can be done. Scan will be aborted
de: Die Datei muss vor der Prüfung gespeichert sein. Prüfung wir abgebrochen

# tl_Scenario_CantCreate
source: Can\'t create scenario
de: Kann Testszenario nicht erstellen.

# tl_Scenario_MinOneInput
source: A scenario needs at least one input cell value.
de: Ein Testszenario braucht mindestens eine Eingabezelle.

# tl_Scenario_MinOneOutput
source: A scenario needs at least one output cell value.
de: Ein Testszenario braucht mindestens eine Eingabezelle.

# tl_Scenario_Notallcellsfilled
source: You didn't fill all selected input-, output- and itermediatecells. Possible solutions: - fill these missing cells - abort the scenario creation. - delete unncessaryselected cells and try it again.
de: Sie haben nicht alle von Ihnen zuvor markierten Zellen (Eingabe-, Zwischenergebnis- und Ausgabezellen) befüllt. Bite befüllen Sie die fehlenden Zellen oder brechen Sie die Szenario-Erstellung ab, entfernen Sie unnötige Markierungen und versuchen Sie es erneut.

# tl_Separator_Confirmed_all
source: Yes don\'t show again
de: Ja, Warnmeldung nicht mehr anzeigen

# tl_Separator_Confirmed_this
source: Yes, ignore it in this field
de: Ja, Wanrmeldung für dieses Feld nicht mehr anzeigen

# tl_Separator_intended
source: You have used a thousands separator character, was this intended behavior?
de: Sie haben ein Tausendertrennzeichen verwendet. War dies mit Absicht?

# tl_ValidationError
source: The validation caused an error!
de: Die Validierung hat einen Fehler verursacht!

# tl_Scan_unsuccessfulMessage
source: Scan failed.
de: Prüfung konnte nicht erfolgreich durchgeführt werden.

# tl_SIFCorecrashed
source: Unfortunatly SIFCore crashed. Try scanning the file again and if this doesn't help close and open the file again.
de: Leider ist SIFCore abgestürtzt. Bitte starten Sie eine neue Prüfung. Wenn dann noch immer eine Fehlermeldung kommt schließen Sie Excel einmal und öffnen Sie die Datei erneut.

# tl_OutOfMemory
source: There is not enough memory (RAM) to scan the file
de: Nicht genügend Arbeitsspeicher für eine Prüfung vorhanden

# tl_stopEdit
source: Please stop editing the cell and start a new scan
de: Bitte stoppen sie das Editieren der Zelle und starten sie eine neue Prüfung

# tl_StartNewScan
source: Please start a new Scans
de: Bitte starten Sie eine neue Prüfung

# tl_MemoryRestrictions
source: The inspection queue has been cleared due to memory restrictions.
de: Die Warteschlange für die Prüfungen wurde wegen Speichereinschränkungen gelöscht.

# tl_Archive
source: Archive
de: Archiv

# tl_CellDefinitions
source: Cell definitions
de: Zellendefinitionen

# tl_Ignored
source: Ignored
de: Ignoriert

# tl_Later
source: Later
de: Später

# tl_NoScenariosSide
source: No scenarios created. Please create a new scenario from the Ribbon menu.
de: Keine Testszenario erstellt. Bitte erstellen sie ein neues Szenario.

# tl_Open
source: Open
de: Offen

# tl_ScenarioOverview
source: Scenario Overview
de: Testszenario Übersicht

# tl_Ribbon_AreaRule_RuleEditor
source: Rule Editor
de: Neue Daten-Regel erstellen

# tl_Rules
source: Rules
de: Regeln

# tl_Sidebar_Rules
source: Rules
de: Regeln

# tl_NoRulesSide
source: No Rules created. Please create a new Rule with the Rule Editor.
de: Keine Regeln vorhanden. Bitte erstellen Sie eine neue Regel.

# tl_Cancel
source: Cancel
de: Abbrechen

# tl_Ribbon_AreaRule_Title
source: Rules
de: Regeln

# tl_RuleEditor_CellPicker
source: Choose Rule application area
de: Anwendungsbereich wählen

# tl_RuleEditor_Condition
source: Condition(s):
de: Bedingungen:

# tl_RuleEditor_Condition_CharacterCount
source: Character Count
de: Gesamtanzahl Zeichen

# tl_RuleEditor_Confirm
source: Create new Rule
de: OK

# tl_RuleEditor_FilterCondition
source: Trigger when:
de: Filterbedingungen:

# tl_RuleEditor_FilterConditionAND
source: All conditions are satisfied
de: Alle Bedingungen sind erfüllt

# tl_RuleEditor_FilterConditionNONE
source: No Condition is satisfied
de: Keine Bedingung ist erfüllt

# tl_RuleEditor_FilterConditionOR
source: (At least) one condition is satisfied
de: (Mindestens) eine Bedingung ist erfüllt

# tl_RuleEditor_NewCondition
source: New Condition
de: Neue Bedingung

# tl_RuleEditor_RuleArea
source: Cell Area:
de: Anwendungsbereich:

# tl_RuleEditor_RuleDescription
source: Rule Description:
de: Regelbeschreibung:

# tl_CellPicker_Confirm
source: Confirm
de: Bestätigen

# tl_CellPicker_Text
source: Please ‪select the Cell area on the spreadsheet where the Rule should be applied.
de: Bitte wählen sie den Zellenbereich in der Arbeitsmappe aus, auf den die Regel angewendet werden soll.

# tl_RuleEditor_Title
source: Rule Editor
de: Regel Editor

# tl_RuleEditor_NoCondition
source: No condition specified. Please create at least one condition for the rule
de: Keine Bedingungen gefunden. Bitte erstellen Sie mindestens eine Bedingung für die Regel

# tl_RuleEditor_NoDescription
source: No Description found. The rule will be created without an description.
de: Keine Regelbeschreibung gefunden. Die Regel wird ohne eine Beschreibung erstellt.

# tl_RuleEditor_NoName
source: No name found. Please enter a name for the rule
de: Kein Name gefunden. Bitte geben sie der Regel einen Namen

# tl_ConditionPicker_ChooseConditionType
source: Please choose the type of the new condition.
de: Wählen sie den Typ, den die neue Bedingung haben soll.

# tl_ConditionPicker_ChooseRegex
source: Please enter a valid Regex string. This string will limit the contents of the cell.
de: Bitte geben sie einen Regex String ein. Dieser String limitiert die Werte einer Zelle.

# tl_ConditionPicker_ConditionName
source: Name of the Condition:
de: Name der Bedingung:

# tl_ConditionPicker_Confirm
source: Create Condition
de: Erstelle Bedingung

# tl_RuleEditor_ToolTip_CellArea
source: The area where the rule will be applied.
de: Legt den Anwendungsbereich der Regel fest. Klicken sie dazu auf "Anwendungsbereich wählen", markieren sie die gewünschten Zellen, und klicken Sie dann auf "Bestätigen".

# tl_RuleEditor_ToolTip_Condition
source: A rule consists of one or more conditions that can be added with "Add new Condition".
de: Eine Regel besteht aus einer oder mehreren Bedingungen bestehen, die Sie hier erstellen können. Klicken sie dazu auf "Neue Bedingung", und wählen Sie eine Art aus.

# tl_RuleEditor_ToolTip_Description
source: A description of the rule that should describe the usage.
de: Eine Regelbeschreibung sollte ein Hilfstext sein, der erklärt was die Regel bezwecken soll.

# tl_RuleEditor_ToolTip_Name
source: The name this rule will be using from now.
de: Bitte geben sie einen gültigen Namen für die Regel ein. Dieser Name wird zum Identifizieren der Regel verwendet.

# tl_ConditionPicker_ChooseEmpty
source: The cell has to be empty.
de: Die Zelle soll leer sein.

# tl_ConditionPicker_Empty
source: Empty Cell
de: Leere Zelle

# tl_CellPicker_ToManyCells
source: Please dont assign more than 10000 cells to a rule.
de: Bitte weisen sie einer Regel nicht mehr als 10000 Zellen zu.

# tl_ConditionPicker_Choose1Comma
source: Only allows 1 digit after comma.
de: Erlaubt bis zu einer Nachkommastelle.

# tl_ConditionPicker_Choose2Comma
source: Only allows up to 2 digits after comma.
de: Erlaubt bis zu 2 Nachkommastellen.

# tl_ConditionPicker_ChooseOnlyNumbers
source: Only allows Numbers
de: Erlaubt nur Zahlen.

# tl_ConditionPicker_NoCharCount
source: Please enter a valid interger number.
de: Bitte geben sie eine ganze Zahl ein.

# tl_ConditionPicker_NoCondition
source: Please select your desired Condition type.
de: Bitte wählen sie die Art der Bedingung.

# tl_ConditionPicker_NoName
source: Please enter a name.
de: Bitte geben sie der Bedingung einen Namen.

# tl_ConditionPicker_NoRegex
source: Please enter a valid Regex string.
de: Bitte geben sie einen gültigen Regex String ein.

# tl_RuleEditor_Condition_1Comma
source: 1 or 0 Commas
de: Eine Nachkommastelle

# tl_RuleEditor_Condition_2Comma
source: 0,1 or 2 Commas
de: 2 Nachkommastellen

# tl_RuleEditor_Condition_OnlyNumbers
source: Only Numbers
de: Nur Zahlen

# tl_ToManyCells
source: Please dont select more than 10000 Cells.
de: Bitte wählen sie nicht mehr als 10000 Zellen aus.

# tl_CellPicker_Label
source: Please ‪select the Cell area where the Rule should apply.
de: Bitte wählen sie die Zellen aus, auf den die Regel angewendet werden soll.

# tl_ConditionPicker_ChooseCharacterCount2
source: Please enter a valid Number. This Number ist the limit how many characters are allowed in a cell.
de: Diese Zahl legt die maximal erlaubte Anzahl von Zeichen einer Zelle fest.

# tl_ConditionPicker_NoInputReq
source: There is no Input requiered.
de: Für diese Bedingung sind keine weiteren Eingaben erforderlich.

# tl_RuleEditor_NoRuleCells
source: No Rule Cells.
de: Bitte geben sie an, auf welche Zellen die Regel angewendet werden soll.

# tl_ViolationView_NoViolations
source: No Violations in this tab.
de: Keine Befund(e) vorhanden

# tl_ConditionPicker_Error
source: Invalid Condition type.
de: Ungültiger Typ der Bedingung.
